flange-build/flange/components/packages/tab5-all-in-one/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_FREERTOS_HZ=1000
# Tab5 的 UART0(G37/G38) 引到 M5-Bus，不与显示/音频争引脚，保留完整串口控制台
# （与 Cardputer 的 CONFIG_ESP_CONSOLE_NONE 相反）。
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# TinyUSB vendor 类：esp_tinyusb 用 *_COUNT(int) 启用，>0 即开启 CFG_TUD_VENDOR
CONFIG_TINYUSB_VENDOR_COUNT=1
# 32MB Octal PSRAM：DPI 帧缓冲(1.84MB) + GUD 收帧缓冲都放这里
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
# gud_device.c 的 s_fb/s_cbuf 按 640x360 算共 ~900KB，超出内部 SRAM；
# 配合 main/linker.lf 的 extram_bss 映射把这两个数组挪去 PSRAM。
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
